---
kind: other
id: Methods.T:Autodesk.Revit.DB.HostObject
source: html/23ae9deb-a7bb-a19d-7bc7-04da20352d6d.htm
---
# HostObject Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.